# CircularParentage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeEntryFailures..::..CircularParentage Property
BuiltInFailures..::..KeyBasedTreeEntryFailures Class See Also
---
A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularParentage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularParentage As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularParentage {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace